// The player has the option to pause the game.  When the game is paused, this text is used to
// remind the player that the game is paused to prevent any confusion. 
"PausedInstructions" = "PAUSED";
"Paused" = "PAUSED";

// Each level consists of multiple rounds or waves and the current round is displayed on-screen.
"Round#" = "ROUND %%d";

// The highscore table contains multiple headings to describe the high score that was achieved.
"Name" = "Name";
"Round" = "Round";
"Score" = "Score";

// When a new game is initiated, several tutorial tips appear to teach the player how to interact with the game.
"TutorialTip01" = "Navigate the playing field by sliding your finger across the screen.  Pinch the screen to zoom.";
"TutorialTip02" = "To upgrade or sell a tower, click on the tower during play.";
"TutorialTip03" = "Drag one of these icons onto the playing field to build a tower.";
"TutorialTip04" = "Use these buttons to pause or exit the game.";

// Each map can be played under a different rule set, otherwise known as a gameplay mode.
"Mode" = "Mode";

"Classic"  = "Classic";
"Extended" = "Extended";
"Endless"  = "Endless";
"SuddenDeath" = "Sudden Death";
"TimeTrial" = "Time Trial";
"TowerCombo1" = "Tower Combo 1";
"TowerCombo2" = "Tower Combo 2";

// Difficulty levels
"Difficulty" = "Difficulty";

"Easy" = "Easy";
"Medium" = "Medium";
"Hard" = "Hard";

// The maps are distinguished from one another by name.
"OfficialMapName01" = "Grasslands";
"OfficialMapName02" = "Crossroads";
"OfficialMapName03" = "Drylands";
"OfficialMapName04" = "Skyway";
"OfficialMapName05" = "Frostbite";
"OfficialMapName06" = "Crystal Caves";
"OfficialMapName07" = "Mudslide";
"OfficialMapName08" = "LavaFlow";
"OfficialMapName09" = "Full Game";
"OfficialMapName10" = "Mudslide";
"OfficialMapName11" = "LavaFlow";

// To prepare the player for the challenge that is to come, a short description of the level is provided.
"OfficialMapDescription01" = "Prevent enemies from crossing the grassy field and infiltrating the base.";
"OfficialMapDescription02" = "Defend against enemies from the northern and western gates in this factory warehouse.";
"OfficialMapDescription03" = "Protect the desert canyon from the western mines and northern route.";
"OfficialMapDescription04" = "Take to platforms in the skies on a large battlefield maze.";
"OfficialMapDescription05" = "Enter the frozen tundra, and defend against enemy waves from all four directions.";
"OfficialMapDescription06" = "Stop enemies from harvesting valuable crystals in this deep mining operation.";
"OfficialMapDescription07" = "Prevent enemies and railway reinforcements from crossing the muddy jungle.";
"OfficialMapDescription08" = "Repel invading enemies from taking over the secret volcano base.";
"OfficialMapDescription10" = "CO-OP: Join forces to prevent enemies from crossing the muddy jungle.";
"OfficialMapDescription11" = "PvP: Go head-to-head in a heated battle for top score in this active volcano.";

// Maps and gameplay modes can be unlocked by accomplishing certain tasks.
"UnlockDescription00" = "[LOCKED] Get any additional levels to unlock this mode.";
"UnlockDescription01" = "[LOCKED] To unlock, buy the %%s DLC.";
// "UnlockDescription02" = "[LOCKED] To unlock, reach round 50 on Grasslands.";
// "UnlockDescription03" = "[LOCKED] To unlock, reach round 50 on Crossroads.";
// "UnlockDescription04" = "[LOCKED] To unlock, reach round 50 on Drylands.";
// "UnlockDescription05" = "[LOCKED] To unlock, reach round 50 on Skyway.";
// "UnlockDescription06" = "[LOCKED] To unlock, reach round 50 on Frostbite.";
// "UnlockDescription07" = "[LOCKED] To unlock, reach round 50 on Crystal Caves.";
// "UnlockDescription08" = "[LOCKED] To unlock, reach round 50 on Mudslide.";
"UnlockDescription09" = "Get the full game for 28%%%% off now! Includes more maps, more weapons, more enemies, and more fun!";

// Tower Combo 2 Mode requires classic to be beat and specific dlcs
"TowerCombo2AndEndlessUnlockDescription" = "[Locked] To unlock, beat Classic mode and buy the %%s DLC.";

// Tower Combo 2 is hungry for brains
"TowerCombo2UnlockDescription" = "[Locked] To Unlock, buy the %%s DLC.";

// Each gameplay mode defines a different rule set.  The following text describes the rules for each available gameplay mode.
"50RoundModeDescription"     = "Defend your territory using 4 towers over 50 rounds.";
"ClassicModeDescription"     = "Defend your territory using 4 towers over 100 rounds.";
"ExtendedModeDescription"    = "Defend your territory using 6 towers over 100 rounds.";
"EndlessModeDescription"     = "Endure an endless onslaught of enemies using 6 towers.";
"SuddenDeathModeDescription" = "Survive 100 rounds with just 1 life.";
"TimeTrialModeDescription"   = "Race against the clock to reach the highest score.";
"TowerCombo1ModeDescription" = "Create new strategies with a unique array of towers.";
"TowerCombo2ModeDescription" = "Create new strategies with a unique array of towers.";

// When a particular objective is met, text is displayed on-screen to notify the player that the objective was completed.
"NewMapUnlocked"	      = "NEW MAP UNLOCKED";
"ExtendedModeUnlocked"    = "EXTENDED MODE UNLOCKED";
"EndlessModeUnlocked"     = "ENDLESS MODE UNLOCKED";
"SuddenDeathModeUnlocked" = "SUDDEN DEATH MODE UNLOCKED";
"TimeTrialModeUnlocked"   = "TIME TRIAL MODE UNLOCKED";
"TowerCombo1ModeUnlocked" = "TOWER COMBO 1 MODE UNLOCKED";
"TowerCombo2ModeUnlocked" = "TOWER COMBO 2 MODE UNLOCKED";
"FastForwardUnlocked"  = "FAST FORWARD UNLOCKED";

// When a new game is initiated, an timer appears on-screen to give the player time to prepare.
"TouchScreenBeginPlay" = "";
"GameCountdownTimer"   = "GAME WILL BEGIN IN %%d";

// When a high score is achieved, a message letting the user know and asking him to enter his name appears
"NewHighScore" = "New high score! Enter your name.";

// When a preferences datafile on the memcard is viewed through the XMB, this is the description of the that file
"SaveDataTitle" = "Preferences";
"SaveDataDetail" = "Settings, unlocked maps, and high scores.";

// When a preferences/savegame combo datafile on the memcard is viewed through the XMB, this is the description of the that file
"SaveDataComboTitle" = "Preferences and autosaved game";

// Achievements
"AchievementTitle000" = "That Was Easy!";
"AchievementTitle001" = "Boot Camp Junior";
"AchievementTitle002" = "Field Private";
"AchievementTitle003" = "Field Corporal";
"AchievementTitle004" = "Field Sergeant";
"AchievementTitle005" = "Fieldrunner";
"AchievementTitle006" = "Grasslands Bronze";
"AchievementTitle007" = "Grasslands Silver";
"AchievementTitle008" = "Grasslands Gold";
"AchievementTitle009" = "That Was Easy, Again!";
"AchievementTitle010" = "Boot Camp Senior";
"AchievementTitle011" = "Base Sergeant";
"AchievementTitle012" = "Base Major";
"AchievementTitle013" = "Base Officer";
"AchievementTitle014" = "Baserunner";
"AchievementTitle015" = "Crossroads Bronze";
"AchievementTitle016" = "Crossroads Silver";
"AchievementTitle017" = "Crossroads Gold";
"AchievementTitle018" = "Cakewalk";
"AchievementTitle019" = "Boot Camp Dominator";
"AchievementTitle020" = "Desert Lieutenant";
"AchievementTitle021" = "Desert Captain";
"AchievementTitle022" = "Desert Commander";
"AchievementTitle023" = "Desertrunner";
"AchievementTitle024" = "Now We're Talking!";
"AchievementTitle025" = "Boot Camp Master";
"AchievementTitle026" = "Sky Captain";
"AchievementTitle027" = "Sky Colonel";
"AchievementTitle028" = "Sky Commodore";
"AchievementTitle029" = "Skyrunner";
"AchievementTitle030" = "Skyway Bronze";
"AchievementTitle031" = "Skyway Silver";
"AchievementTitle032" = "Skyway Gold";
"AchievementTitle033" = "Make My Day!";
"AchievementTitle034" = "Boot Camp Complete";
"AchievementTitle035" = "Ice Colonel";
"AchievementTitle036" = "Ice Brigadier";
"AchievementTitle037" = "Ice General";
"AchievementTitle038" = "Icerunner";
"AchievementTitle039" = "Frostbite Bronze";
"AchievementTitle040" = "Frostbite Silver";
"AchievementTitle041" = "Frostbite Gold";
"AchievementTitle042" = "No Mercy";
"AchievementTitle043" = "They Keep Coming, I Keep Gunning";
"AchievementTitle044" = "Statistic";
"AchievementTitle045" = "Berzerker";
"AchievementTitle046" = "Active Denial System";
"AchievementTitle047" = "Precious Snowflake";
"AchievementTitle048" = "Slice Them Up!";
"AchievementTitle049" = "I Love the Smell of Napalm...";
"AchievementTitle050" = "Nuclear Dawn";
"AchievementTitle051" = "Jelly Up!";
"AchievementTitle052" = "Hard Worker";
"AchievementTitle053" = "Patience is a Virtue";
"AchievementTitle054" = "Lemming!";
"AchievementTitle055" = "War Hero";
"AchievementTitle056" = "Commander-in-Chief";
"AchievementTitle057" = "FLAWLESS!";
"AchievementTitle058" = "THIS IS SPARTA!";
"AchievementTitle059" = "Aerial Survivalist";
"AchievementTitle060" = "Aerial Madman";
"AchievementTitle061" = "Impenetrable!";
"AchievementTitle062" = "Warming Up";
"AchievementTitle063" = "Iron Fist";
"AchievementTitle064" = "Master Plan";
"AchievementTitle065" = "Purple Heart";
"AchievementTitle066" = "Diehard";
"AchievementTitle067" = "Mow Them Down";
"AchievementTitle068" = "Slow Mow!";
"AchievementTitle069" = "Blow 'em Up!";
"AchievementTitle070" = "Mad Scientist";
"AchievementTitle071" = "Global Warmer";
"AchievementTitle072" = "Manhattan Project";
"AchievementTitle073" = "Cuts Like Butter";
"AchievementTitle074" = "Nuclear Winter";
"AchievementTitle075" = "Guerrilla Warfare";
"AchievementTitle076" = "Medal of Honor";
"AchievementTitle077" = "HARDCORE!";
"AchievementTitle078" = "Drylands Bronze";
"AchievementTitle079" = "Drylands Silver";
"AchievementTitle080" = "Drylands Gold";
"AchievementTitle081" = "It's Better to be Alive";
"AchievementTitle082" = "Time Flies";
"AchievementTitle083" = "Insane!";
"AchievementTitle084" = "Strategic Genius";
"AchievementTitle085" = "Daredevil";
"AchievementTitle086" = "Solar Flare";
"AchievementTitle087" = "Welcome to the Jungle";
"AchievementTitle088" = "Mud on Your Boots";
"AchievementTitle089" = "Jungle Recon";
"AchievementTitle090" = "Natural Born Sniper";
"AchievementTitle091" = "Green Beret";
"AchievementTitle092" = "Mudrunner";
"AchievementTitle093" = "Mudslide Bronze";
"AchievementTitle094" = "Mudslide Silver";
"AchievementTitle095" = "Mudslide Gold";
"AchievementTitle096" = "Get off my Lawn";
"AchievementTitle097" = "Easy Shine";
"AchievementTitle098" = "Crystal Clear";
"AchievementTitle099" = "Through the Looking Glass";
"AchievementTitle100" = "Diamonds are Forever";
"AchievementTitle101" = "Master Miner";
"AchievementTitle102" = "Crystalrunner";
"AchievementTitle103" = "Crystal Caves Bronze";
"AchievementTitle104" = "Crystal Caves Silver";
"AchievementTitle105" = "Crystal Caves Gold";
"AchievementTitle106" = "Super Volcano";
"AchievementTitle107" = "Go With the Flow";
"AchievementTitle108" = "Firecracker";
"AchievementTitle109" = "Fire Away";
"AchievementTitle110" = "Firewalker";
"AchievementTitle111" = "Flame Thrower";
"AchievementTitle112" = "Lavarunner";
"AchievementTitle113" = "Lavaflow Bronze";
"AchievementTitle114" = "Lavaflow Silver";
"AchievementTitle115" = "Lavaflow Gold";
"AchievementTitle116" = "Heavy Poison";

"AchievementDescription000" = "Get to round 50 on Grasslands in Classic mode on Easy.";
"AchievementDescription001" = "Get to round 100 on Grasslands in Classic mode on Easy.";
"AchievementDescription002" = "Get to round 50 on Grasslands in Classic mode on Medium.";
"AchievementDescription003" = "Get to round 100 on Grasslands in Classic mode on Medium.";
"AchievementDescription004" = "Get to round 50 on Grasslands in Classic mode on Hard.";
"AchievementDescription005" = "Get to round 100 on Grasslands in Classic mode on Hard.";
"AchievementDescription006" = "Get to round 100 on Grasslands in Extended mode on Easy.";
"AchievementDescription007" = "Get to round 100 on Grasslands in Extended mode on Medium.";
"AchievementDescription008" = "Get to round 100 on Grasslands in Extended mode on Hard.";
"AchievementDescription009" = "Get to round 50 on Crossroads in Classic mode on Easy.";
"AchievementDescription010" = "Get to round 100 on Crossroads in Classic mode on Easy.";
"AchievementDescription011" = "Get to round 50 on Crossroads in Classic mode on Medium.";
"AchievementDescription012" = "Get to round 100 on Crossroads in Classic mode on Medium.";
"AchievementDescription013" = "Get to round 50 on Crossroads in Classic mode on Hard.";
"AchievementDescription014" = "Get to round 100 on Crossroads in Classic mode on Hard.";
"AchievementDescription015" = "Get to round 100 on Crossroads in Extended mode on Easy.";
"AchievementDescription016" = "Get to round 100 on Crossroads in Extended mode on Medium.";
"AchievementDescription017" = "Get to round 100 on Crossroads in Extended mode on Hard.";
"AchievementDescription018" = "Get to round 50 on Drylands in Classic mode on Easy.";
"AchievementDescription019" = "Get to round 100 on Drylands in Classic mode on Easy.";
"AchievementDescription020" = "Get to round 50 on Drylands in Classic mode on Medium.";
"AchievementDescription021" = "Get to round 100 on Drylands in Classic mode on Medium.";
"AchievementDescription022" = "Get to round 50 on Drylands in Classic mode on Hard.";
"AchievementDescription023" = "Get to round 100 on Drylands in Classic mode on Hard.";
"AchievementDescription024" = "Get to round 50 on Skyway in Classic mode on Easy.";
"AchievementDescription025" = "Get to round 100 on Skyway in Classic mode on Easy.";
"AchievementDescription026" = "Get to round 50 on Skyway in Classic mode on Medium.";
"AchievementDescription027" = "Get to round 100 on Skyway in Classic mode on Medium.";
"AchievementDescription028" = "Get to round 50 on Skyway in Classic mode on Hard.";
"AchievementDescription029" = "Get to round 100 on Skyway in Classic mode on Hard.";
"AchievementDescription030" = "Get to round 100 on Skyway in Extended mode on Easy.";
"AchievementDescription031" = "Get to round 100 on Skyway in Extended mode on Medium.";
"AchievementDescription032" = "Get to round 100 on Skyway in Extended mode on Hard.";
"AchievementDescription033" = "Get to round 50 on Frostbite in Classic mode on Easy.";
"AchievementDescription034" = "Get to round 100 on Frostbite in Classic mode on Easy.";
"AchievementDescription035" = "Get to round 50 on Frostbite in Classic mode on Medium.";
"AchievementDescription036" = "Get to round 100 on Frostbite in Classic mode on Medium.";
"AchievementDescription037" = "Get to round 50 on Frostbite in Classic mode on Hard.";
"AchievementDescription038" = "Get to round 100 on Frostbite in Classic mode on Hard.";
"AchievementDescription039" = "Get to round 100 on Frostbite in Extended mode on Easy.";
"AchievementDescription040" = "Get to round 100 on Frostbite in Extended mode on Medium.";
"AchievementDescription041" = "Get to round 100 on Frostbite in Extended mode on Hard.";
"AchievementDescription042" = "Defeat 5,000 fieldrunners.";
"AchievementDescription043" = "Defeat 25,000 fieldrunners.";
"AchievementDescription044" = "Defeat 100,000 fieldrunners.";
"AchievementDescription045" = "Defeat 500,000 fieldrunners.";
"AchievementDescription046" = "Defeat 1,000,000 fieldrunners.";
"AchievementDescription047" = "Slow down 50,000 fieldrunners with the Ice Tower.";
"AchievementDescription048" = "Defeat 5,000 fieldrunners with the Laser Tower.";
"AchievementDescription049" = "Defeat 5,000 fieldrunners with the Flame Tower.";
"AchievementDescription050" = "Defeat 15,000 fieldrunners with the Mortar Tower.";
"AchievementDescription051" = "Slow down 100,000 fieldrunners with the Goo Tower.";
"AchievementDescription052" = "Get defeated 100 times.";
"AchievementDescription053" = "Get defeated 500 times.";
"AchievementDescription054" = "Get defeated 1,000 times.";
"AchievementDescription055" = "Achieve 100 victories.";
"AchievementDescription056" = "Achieve 500 victories.";
"AchievementDescription057" = "Achieve victory without taking any damage.";
"AchievementDescription058" = "Achieve 100 victories without losing any lives.";
"AchievementDescription059" = "Destroy 100 air units.";
"AchievementDescription060" = "Destroy 500 air units.";
"AchievementDescription061" = "Destroy 5,000 air units.";
"AchievementDescription062" = "Score 100,000 points on any map in a single session.";
"AchievementDescription063" = "Score 500,000 points on any map in a single session.";
"AchievementDescription064" = "Score 850,000 points on any map in a single session.";
"AchievementDescription065" = "Survive any map with only 1 life.";
"AchievementDescription066" = "Play 75 rounds consecutively with 1 life.";
"AchievementDescription067" = "Fully upgrade a Gatling Tower.";
"AchievementDescription068" = "Fully upgrade a Goo Tower.";
"AchievementDescription069" = "Fully upgrade a Missile Tower.";
"AchievementDescription070" = "Fully upgrade a Tesla Tower.";
"AchievementDescription071" = "Fully upgrade a Flame Tower.";
"AchievementDescription072" = "Fully upgrade a Mortar Tower.";
"AchievementDescription073" = "Fully upgrade a Laser Tower.";
"AchievementDescription074" = "Fully upgrade an Ice Tower.";
"AchievementDescription075" = "Buy and sell 20 towers consecutively.";
"AchievementDescription076" = "Unlock 50%% of all achievements.";
"AchievementDescription077" = "Unlock all achievements.";
"AchievementDescription078" = "Get to round 100 on Drylands in Extended mode on Easy.";
"AchievementDescription079" = "Get to round 100 on Drylands in Extended mode on Medium.";
"AchievementDescription080" = "Get to round 100 on Drylands in Extended mode on Hard.";
"AchievementDescription081" = "Get to round 150 on any map in Endless mode on Easy.";
"AchievementDescription082" = "Get to round 250 on any map in Endless mode on Easy.";
"AchievementDescription083" = "Get to round 500 on any map in Endless mode on Easy.";
"AchievementDescription084" = "Get to round 250 on any map in Endless mode on Medium.";
"AchievementDescription085" = "Get to round 150 on any map in Endless mode on Hard.";
"AchievementDescription086" = "Fully upgrade a Plasma Tower.";
"AchievementDescription087" = "Get to round 50 on Mudslide in Classic mode on Easy.";
"AchievementDescription088" = "Get to round 100 on Mudslide in Classic mode on Easy.";
"AchievementDescription089" = "Get to round 50 on Mudslide in Classic mode on Medium.";
"AchievementDescription090" = "Get to round 100 on Mudslide in Classic mode on Medium.";
"AchievementDescription091" = "Get to round 50 on Mudslide in Classic mode on Hard.";
"AchievementDescription092" = "Get to round 100 on Mudslide in Classic mode on Hard.";
"AchievementDescription093" = "Get to round 100 on Mudslide in Extended mode on Easy.";
"AchievementDescription094" = "Get to round 100 on Mudslide in Extended mode on Medium.";
"AchievementDescription095" = "Get to round 100 on Mudslide in Extended mode on Hard.";
"AchievementDescription096" = "Fully upgrade a Shotgun Tower";
"AchievementDescription097" = "Get to round 50 on Crystal Caves in Classic mode on Easy.";
"AchievementDescription098" = "Get to round 100 on Crystal Caves in Classic mode on Easy.";
"AchievementDescription099" = "Get to round 50 on Crystal Caves in Classic mode on Medium.";
"AchievementDescription100" = "Get to round 100 on Crystal Caves in Classic mode on Medium.";
"AchievementDescription101" = "Get to round 50 on Crystal Caves in Classic mode on Hard.";
"AchievementDescription102" = "Get to round 100 on Crystal Caves in Classic mode on Hard.";
"AchievementDescription103" = "Get to round 100 on Crystal Caves in Extended mode on Easy.";
"AchievementDescription104" = "Get to round 100 on Crystal Caves in Extended mode on Medium.";
"AchievementDescription105" = "Get to round 100 on Crystal Caves in Extended mode on Hard.";
"AchievementDescription106" = "Fully upgrade a Lava Tower.";
"AchievementDescription107" = "Get to round 50 on Lavaflow in Classic mode on Easy.";
"AchievementDescription108" = "Get to round 100 on Lavaflow in Classic mode on Easy.";
"AchievementDescription109" = "Get to round 50 on Lavaflow in Classic mode on Medium.";
"AchievementDescription110" = "Get to round 100 on Lavaflow in Classic mode on Medium.";
"AchievementDescription111" = "Get to round 50 on Lavaflow in Classic mode on Hard.";
"AchievementDescription112" = "Get to round 100 on Lavaflow in Classic mode on Hard.";
"AchievementDescription113" = "Get to round 100 on Lavaflow in Extended mode on Easy.";
"AchievementDescription114" = "Get to round 100 on Lavaflow in Extended mode on Medium.";
"AchievementDescription115" = "Get to round 100 on Lavaflow in Extended mode on Hard.";
"AchievementDescription116" = "Fully upgrade a Poison Tower.";

// The credits screen
"CreditsHeading001" = "Original Game By";
"CreditsHeading002" = "HTML5 Port";
"CreditsHeading003" = "HTML5 Contributors";

"CreditsNames001" = "Jamie Gotch\\nSergei Gourski\\nLeo Montenegro\\n ";
"CreditsNames002" = "Michael \"Z\" Goddard\\nGradient Studios\\n \\nDarius Kazemi\\nMike Pennisi\\nBocoup\\n ";
"CreditsNames003" = "Jim Buck\\nSean Duane\\nGordon Fellows\\nAlec Shobin\\nEric Sutman\\n ";
